replace arch with mermaid
